tsung/http_qida.xml
<?xml version="1.0"?>
<!DOCTYPE tsung SYSTEM "/usr/share/tsung/tsung-1.0.dtd">
<tsung loglevel="notice" version="1.0">

  <!-- Client side setup -->
  <clients>
    <client host="localhost" use_controller_vm="true"/>
  </clients>
  
  <!-- Server side setup -->
<servers>
  <server host="api.qida.yunxuetang.cn" port="80" type="tcp"></server>
</servers>

  <!-- to start os monitoring (cpu, network, memory). Use an erlang
  agent on the remote machine or SNMP. erlang is the default --> 
  <monitoring>
    <monitor host="qidaapi1" type="erlang"></monitor>
    <monitor host="qidaapi2" type="erlang"></monitor>
  </monitoring>
  
  <load>
  <!-- several arrival phases can be set: for each phase, you can set
  the mean inter-arrival time between new clients and the phase
  duration -->
   <arrivalphase phase="1" duration="1" unit="minute">
     <users interarrival="1" unit="second"></users>
   </arrivalphase>
  </load>

  <options>
   <option type="ts_http" name="user_agent">
    <user_agent probability="80">Mozilla/5.0 (X11; U; Linux i686; en-US; rv:1.7.8) Gecko/20050513 Galeon/1.3.21</user_agent>
    <user_agent probability="20">Mozilla/5.0 (Windows; U; Windows NT 5.2; fr-FR; rv:1.7.8) Gecko/20050511 Firefox/1.0.4</user_agent>
   </option>
   <option name="file_server" id="userlist" value="/opt/tsung/userlist.csv"></option>
  </options>

  <!-- start a session for a http user. the probability is the
  frequency of this type os session. The sum of all session's
  probabilities must be 100 -->

 <sessions>
  <session name="http-login" probability="100" type="ts_http">
    <setdynvars sourcetype="file" fileid="userlist" delimiter="," order="iter">
      <var name="username" />
      <var name="password" />
    </setdynvars>   

    <!-- full url with server name, this overrides the "server" config value -->
    <request subst="true">
      <http 
        url="http://api.qida.yunxuetang.cn/v1/users/tokens" 
        method="POST" 
        version="1.1"
        content_type="application/json" 
        contents="{&quot;deviceId&quot;: &quot;&quot;,&quot;domainName&quot;: &quot;test20141031.yunxuetang.cn&quot;,&quot;isCheck&quot;: 1,&quot;password&quot;: &quot;%%_password%%&quot;,&quot;userName&quot;: &quot;%%_username%%&quot;}">
    
      </http>
    </request>
    <!--
    <request> <http url="/images/accueil1.gif" method="GET" version="1.1" if_modified_since="Fri, 14 Nov 2003 02:43:31 GMT"></http> </request>
    <request> <http url="/images/accueil2.gif" method="GET" version="1.1" if_modified_since="Fri, 14 Nov 2003 02:43:31 GMT"></http> </request>
    <request> <http url="/images/accueil3.gif" method="GET" version="1.1" if_modified_since="Fri, 14 Nov 2003 02:43:31 GMT"></http> </request>
    -->
    <thinktime value="0.2" random="true"></thinktime>
    <!--
    <request> <http url="/index.en.html" method="GET" version="1.1" ></http> </request>
    -->
  </session>
 </sessions>
</tsung>